#include "StdInc.h"

#include "rwimaging.hxx"

#include <sdk/PluginHelpers.h>

#include "pixelformat.hxx"

#include "streamutil.hxx"

namespace rw
{

#ifdef RWLIB_INCLUDE_TGA_IMAGING
// .tga RenderWare imaging extension.
// this image format is natively implemented, so no additional .lib is required.

typedef uint8 BYTE;
typedef uint16 WORD;
typedef uint32 DWROD;

#pragma pack(push,1)
struct TgaHeader
{
    endian::little_endian <BYTE> IDLength;        /* 00h  Size of Image ID field */
    endian::little_endian <BYTE> ColorMapType;    /* 01h  Color map type */
    endian::little_endian <BYTE> ImageType;       /* 02h  Image type code */
    endian::little_endian <WORD> CMapStart;       /* 03h  Color map origin */
    endian::little_endian <WORD> CMapLength;      /* 05h  Color map length */
    endian::little_endian <BYTE> CMapDepth;       /* 07h  Depth of color map entries */
    endian::little_endian <WORD> XOffset;         /* 08h  X origin of image */
    endian::little_endian <WORD> YOffset;         /* 0Ah  Y origin of image */
    endian::little_endian <WORD> Width;           /* 0Ch  Width of image */
    endian::little_endian <WORD> Height;          /* 0Eh  Height of image */
    endian::little_endian <BYTE> PixelDepth;      /* 10h  Image pixel size */

    struct
    {
        unsigned char numAttrBits : 4;
        unsigned char imageOrdering : 2;
        unsigned char reserved : 2;
    } ImageDescriptor; /* 11h  Image descriptor byte */
};
#pragma pack(pop)

inline uint32 getTGATexelDataRowAlignment( void )
{
    // I believe that TGA image data is packed by bytes.
    // The documentation does not mention anything!
    return 1;
}

inline uint32 getTGARasterDataRowSize( uint32 width, uint32 depth )
{
    return getRasterDataRowSize( width, depth, getTGATexelDataRowAlignment() );
}

static void writeTGAPixels(
    Interface *engineInterface,
    const void *texelSource, uint32 texWidth, uint32 texHeight,
    eRasterFormat srcRasterFormat, uint32 srcItemDepth, uint32 srcRowAlignment, ePaletteType srcPaletteType, const void *srcPaletteData, uint32 srcMaxPalette,
